---
title: DocumentSaveToLocalProgressChangedEventArgs
classe: Autodesk.Revit.DB.Events.DocumentSaveToLocalProgressChangedEventArgs
namespace: Autodesk.Revit.DB.Events
eredita: Autodesk.Revit.DB.Events.WorksharedOperationProgressChangedEventArgs
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# DocumentSaveToLocalProgressChangedEventArgs

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean BeforeSaveToCentral { get; }` | `documentSaveToLocalProgressChangedEventArgs.BeforeSaveToCentral` | Boolean |
| `Int32 FinishedStreams { get; }` | `documentSaveToLocalProgressChangedEventArgs.FinishedStreams` | Int32 |
| `Boolean SaveToLocalFinished { get; }` | `documentSaveToLocalProgressChangedEventArgs.SaveToLocalFinished` | Boolean |
| `Int32 TotalStreams { get; }` | `documentSaveToLocalProgressChangedEventArgs.TotalStreams` | Int32 |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```